---
kind: type
id: T:Autodesk.Revit.UI.Events.ComboBoxDropDownClosedEventArgs
source: html/e2bf5805-fb7c-5285-3c22-08534cfce159.htm
---
# Autodesk.Revit.UI.Events.ComboBoxDropDownClosedEventArgs

The event arguments used by ComboBox's DropDownClosed event.

## Syntax (C#)
```csharp
public class ComboBoxDropDownClosedEventArgs : RibbonItemEventArgs
```